great-man2096/STM32F103ZET6-TEST/User/main.c
	// 	// Drawing on the image
	// 	printf("Drawing:page 3\r\n");
	// 	Paint_DrawString_CN(10, 0,"杨世昌", &Font12CN, WHITE, WHITE);
	// 	Paint_DrawString_CN(0, 20, "你好 世界", &Font24CN, WHITE, WHITE);
	// 	// Show image on page3
	// 	OLED_1IN3_Display(BlackImage);
	// 	delay_ms(2000);		
	// 	Paint_Clear(BLACK);	

	// 	// Drawing on the image
	// 	printf("Drawing:page 4\r\n");
	// 	OLED_1IN3_Display(gImage_1in3);
	// 	delay_ms(2000);		
	// 	Paint_Clear(BLACK);	

	// }

	/******************************************************
	图片显示实验
	*******************************************************/
	// uint8_t res;
    // DIR picdir;           /* 图片目录 */
    // FILINFO *picfileinfo; /* 文件信息 */
    // char *pname;          /* 带路径的文件名 */
    // uint16_t totpicnum;   /* 图片文件总数 */
    // uint16_t curindex;    /* 图片当前索引 */
    // uint8_t pause = 0;    /* 暂停标记 */
    // uint8_t t;
    // uint16_t temp;
    // uint32_t *picoffsettbl; /* 图片文件offset索引表 */
	// exfuns_init();           /* 为fatfs相关变量申请内存 */
    // f_mount(fs[0], "0:", 1); /* 挂载SD卡 */
    // f_mount(fs[1], "1:", 1); /* 挂载FLASH */

    // while (fonts_init()) /* 检查字库 */
    // {
    //     lcd_show_string(30, 50, 200, 16, 16, "Font Error!", RED);
    //     delay_ms(200);
    //     lcd_fill(30, 50, 240, 66, WHITE); /* 清除显示 */
    //     delay_ms(200);
    // }

    // text_show_string(30,  50, 200, 16, "正点原子STM32开发板", 16, 0, RED);
    // text_show_string(30,  70, 200, 16, "图片显示 实验", 16, 0, RED);
    // text_show_string(30,  90, 200, 16, "KEY0:NEXT KEY1:PREV", 16, 0, RED);
    // text_show_string(30, 110, 200, 16, "KEY_UP:PAUSE", 16, 0, RED);
    // text_show_string(30, 130, 200, 16, "正点原子@ALIENTEK", 16, 0, RED);

    // while (f_opendir(&picdir, "0:/PICTURE")) /* 打开图片文件夹 */
    // {
    //     text_show_string(30, 150, 240, 16, "PICTURE文件夹错误!", 16, 0, RED);
    //     delay_ms(200);
    //     lcd_fill(30, 150, 240, 186, WHITE); /* 清除显示 */
    //     delay_ms(200);
    // }

    // totpicnum = pic_get_tnum("0:/PICTURE"); /* 得到总有效文件数 */

    // while (totpicnum == NULL) /* 图片文件为0 */
    // {
    //     text_show_string(30, 150, 240, 16, "没有图片文件!", 16, 0, RED);
    //     delay_ms(200);
    //     lcd_fill(30, 150, 240, 186, WHITE); /* 清除显示 */
    //     delay_ms(200);
    // }

    // picfileinfo = (FILINFO *)mymalloc(SRAMIN, sizeof(FILINFO)); /* 申请内存 */
    // pname = mymalloc(SRAMIN, FF_MAX_LFN * 2 + 1);               /* 为带路径的文件名分配内存 */
    // picoffsettbl = mymalloc(SRAMIN, 4 * totpicnum);             /* 申请4*totpicnum个字节的内存,用于存放图片索引 */

    // while (!picfileinfo || !pname || !picoffsettbl) /* 内存分配出错 */
    // {
    //     text_show_string(30, 150, 240, 16, "内存分配失败!", 16, 0, RED);
    //     delay_ms(200);
    //     lcd_fill(30, 150, 240, 186, WHITE); /* 清除显示 */
    //     delay_ms(200);
    // }

    // /* 记录索引 */
    // res = f_opendir(&picdir, "0:/PICTURE"); /* 打开目录 */

    // if (res == FR_OK)
    // {
    //     curindex = 0; /* 当前索引为0 */

    //     while (1) /* 全部查询一遍 */
    //     {
    //         temp = picdir.dptr;                    /* 记录当前dptr偏移 */
    //         res = f_readdir(&picdir, picfileinfo); /* 读取目录下的一个文件 */

    //         if (res != FR_OK || picfileinfo->fname[0] == 0)
    //             break; /* 错误了/到末尾了,退出 */

    //         res = exfuns_file_type(picfileinfo->fname);

    //         if ((res & 0XF0) == 0X50) /* 取高四位,看看是不是图片文件 */
    //         {
    //             picoffsettbl[curindex] = temp; /* 记录索引 */
    //             curindex++;
    //         }
    //     }
    // }

    // text_show_string(30, 150, 240, 16, "开始显示...", 16, 0, RED);
    // delay_ms(1500);
    // piclib_init();                                         /* 初始化画图 */
    // curindex = 0;                                          /* 从0开始显示 */
    // res = f_opendir(&picdir, (const TCHAR *)"0:/PICTURE"); /* 打开目录 */

    // while (res == FR_OK) /* 打开成功 */
    // {
    //     dir_sdi(&picdir, picoffsettbl[curindex]); /* 改变当前目录索引 */
    //     res = f_readdir(&picdir, picfileinfo);    /* 读取目录下的一个文件 */

    //     if (res != FR_OK || picfileinfo->fname[0] == 0)
    //         break; /* 错误了/到末尾了,退出 */

    //     strcpy((char *)pname, "0:/PICTURE/");                    /* 复制路径(目录) */
    //     strcat((char *)pname, (const char *)picfileinfo->fname); /* 将文件名接在后面 */
    //     lcd_clear(BLACK);
    //     piclib_ai_load_picfile(pname, 0, 0, lcddev.width, lcddev.height, 1); /* 显示图片 */
    //     text_show_string(2, 2, lcddev.width, 16, (char *)pname, 16, 1, RED); /* 显示图片名字 */
    //     t = 0;

    //     while (1)
    //     {
    //         if (t > 250)/* 模拟一次按下KEY0 */
	// 		{
	// 			curindex++;

	// 			if (curindex >= totpicnum)
	// 				curindex = 0; /* 到末尾的时候,自动从头开始 */

	// 			break; 
	// 		}

    //         if ((t % 20) == 0)
    //         {
    //             LED0_TOGGLE(); /* LED0闪烁,提示程序正在运行. */
    //         }

    //         if (key2_scan()) /* 上一张 */
    //         {
    //             if (curindex)
    //             {
    //                 curindex--;
    //             }
    //             else
    //             {
    //                 curindex = totpicnum - 1;
    //             }

    //             break;
    //         }
    //         else if (key1_scan()) /* 下一张 */
    //         {
    //             curindex++;

    //             if (curindex >= totpicnum)
    //                 curindex = 0; /* 到末尾的时候,自动从头开始 */

    //             break;
    //         }
    //         else if (key4_scan())
    //         {
    //             pause = !pause;
    //             LED1(!pause); /* 暂停的时候LED1亮. */
    //         }

    //         if (pause == 0)
    //             t++;

    //         delay_ms(10);
    //     }

    //     res = 0;
    // }

    // myfree(SRAMIN, picfileinfo);  /* 释放内存 */
    // myfree(SRAMIN, pname);        /* 释放内存 */
    // myfree(SRAMIN, picoffsettbl); /* 释放内存 */

	/******************************************************
	汉字显示实验
	*******************************************************/
	// uint32_t fontcnt;
    // uint8_t i, j;
    // uint8_t fontx[2]; /* GBK码 */
    // uint8_t key, t;

	// exfuns_init();                      /* 为fatfs相关变量申请内存 */
    // f_mount(fs[0], "0:", 1);            /* 挂载SD卡 */
    // f_mount(fs[1], "1:", 1);            /* 挂载FLASH */

    // while (fonts_init())                /* 检查字库 */
    // {
    // UPD:
    //     lcd_clear(WHITE);               /* 清屏 */
    //     lcd_show_string(30, 30, 200, 16, 16, "STM32", RED);

    //     while (sd_init())               /* 检测SD卡 */
    //     {
    //         lcd_show_string(30, 50, 200, 16, 16, "SD Card Failed!", RED);
    //         delay_ms(200);
    //         lcd_fill(30, 50, 200 + 30, 50 + 16, WHITE);
    //         delay_ms(200);
    //     }

    //     lcd_show_string(30, 50, 200, 16, 16, "SD Card OK", RED);
    //     lcd_show_string(30, 70, 200, 16, 16, "Font Updating...", RED);
    //     key = fonts_update_font(20, 90, 16, (uint8_t *)"0:", RED); /* 更新字库 */

    //     while (key) /* 更新失败 */
    //     {
    //         lcd_show_string(30, 90, 200, 16, 16, "Font Update Failed!", RED);
    //         delay_ms(200);
    //         lcd_fill(20, 90, 200 + 20, 90 + 16, WHITE);
    //         delay_ms(200);
    //     }

