great-man2096/STM32F103ZET6-TEST/User/main.c
    //     lcd_show_string(30, 90, 200, 16, 16, "Font Update Success!   ", RED);
    //     delay_ms(1500);
    //     lcd_clear(WHITE); /* 清屏 */
    // }

    // text_show_string(30, 30, 200, 16, "正点原子STM32开发板", 16, 0, RED);
    // text_show_string(30, 50, 200, 16, "GBK字库测试程序", 16, 0, RED);
    // text_show_string(30, 70, 200, 16, "正点原子@ALIENTEK", 16, 0, RED);
    // text_show_string(30, 90, 200, 16, "按KEY0,更新字库", 16, 0, RED);
    
    
    // text_show_string(30, 110, 200, 16, "内码高字节:", 16, 0, BLUE);
    // text_show_string(30, 130, 200, 16, "内码低字节:", 16, 0, BLUE);
    // text_show_string(30, 150, 200, 16, "汉字计数器:", 16, 0, BLUE);
    
    // text_show_string(30, 180, 200, 24, "对应汉字为:", 24, 0, BLUE);
    // text_show_string(30, 204, 200, 16, "对应汉字(16*16)为:", 16, 0, BLUE);
    // text_show_string(30, 220, 200, 16, "对应汉字(12*12)为:", 12, 0, BLUE);

    // while (1)
    // {
    //     fontcnt = 0;

    //     for (i = 0x81; i < 0xff; i++) /* GBK内码高字节范围为0X81~0XFE */
    //     {
    //         fontx[0] = i;
    //         lcd_show_num(118, 110, i, 3, 16, BLUE); /* 显示内码高字节 */

    //         for (j = 0x40; j < 0xfe; j++) /* GBK内码低字节范围为 0X40~0X7E, 0X80~0XFE) */
    //         {
    //             if (j == 0x7f)
    //                 continue;

    //             fontcnt++;
    //             lcd_show_num(118, 130, j, 3, 16, BLUE);       /* 显示内码低字节 */
    //             lcd_show_num(118, 150, fontcnt, 5, 16, BLUE); /* 汉字计数显示 */
    //             fontx[1] = j;
    //             text_show_font(30 + 132, 180, fontx, 24, 0, BLUE);
    //             text_show_font(30 + 144, 204, fontx, 16, 0, BLUE);
    //             text_show_font(30 + 108, 220, fontx, 12, 0, BLUE);
    //             t = 200;

    //             while (t--) /* 延时,同时扫描按键 */
    //             {
    //                 delay_ms(1);

    //                 if (key1_scan())
    //                 {
    //                     goto UPD; /* 跳转到UPD位置(强制更新字库) */
    //                 }
    //             }

    //             LED0_TOGGLE();
    //         }
    //     }
    // }

	/******************************************************
	FATFS实验
	*******************************************************/
	// uint32_t total, free;
    // uint8_t t = 0;
    // uint8_t res = 0;
    // my_mem_init(SRAMIN);                /* 初始化内部SRAM内存池 */

    // lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30,  70, 200, 16, 16, "FATFS TEST", RED);
    // lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
    // lcd_show_string(30, 110, 200, 16, 16, "Use USMART for test", RED);

    // while (sd_init()) /* 检测不到SD卡 */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "SD Card Error!", RED);
    //     delay_ms(500);
    //     lcd_show_string(30, 130, 200, 16, 16, "Please Check! ", RED);
    //     delay_ms(500);
    //     LED0_TOGGLE(); /* LED0闪烁 */
    // }

    // exfuns_init();                 /* 为fatfs相关变量申请内存 */
	
    // f_mount(fs[0], "0:", 1);       /* 挂载SD卡 */
    // res = f_mount(fs[1], "1:", 1); /* 挂载FLASH. */

    // if (res == 0X0D) /* FLASH磁盘,FAT文件系统错误,重新格式化FLASH */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "Flash Disk Formatting...", RED); /* 格式化FLASH */
    //     res = f_mkfs("1:", 0, 0, FF_MAX_SS);                                    /* 格式化FLASH,1:,盘符;0,使用默认格式化参数 */

    //     if (res == 0)
    //     {
    //         f_setlabel((const TCHAR *)"1:ALIENTEK");                                /* 设置Flash磁盘的名字为：ALIENTEK */
    //         lcd_show_string(30, 130, 200, 16, 16, "Flash Disk Format Finish", RED); /* 格式化完成 */
    //     }
    //     else
    //         lcd_show_string(30, 130, 200, 16, 16, "Flash Disk Format Error ", RED); /* 格式化失败 */

    //     delay_ms(1000);
    // }

    // lcd_fill(30, 130, 240, 150 + 16, WHITE); /* 清除显示 */

    // while (exfuns_get_free((uint8_t*)"0", &total, &free)) /* 得到SD卡的总容量和剩余容量 */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "SD Card Fatfs Error!", RED);
    //     delay_ms(200);
    //     lcd_fill(30, 130, 240, 150 + 16, WHITE); /* 清除显示 */
    //     delay_ms(200);
    //     LED0_TOGGLE(); /* LED0闪烁 */
    // }

    // lcd_show_string(30, 130, 200, 16, 16, "FATFS OK!", BLUE);
    // lcd_show_string(30, 150, 200, 16, 16, "SD Total Size:     MB", BLUE);
    // lcd_show_string(30, 170, 200, 16, 16, "SD  Free Size:     MB", BLUE);
    // lcd_show_num(30 + 8 * 14, 150, total >> 10, 5, 16, BLUE); /* 显示SD卡总容量 MB */
    // lcd_show_num(30 + 8 * 14, 170, free >> 10, 5, 16, BLUE);  /* 显示SD卡剩余容量 MB */

	// /* 测试代码 */
	// // FIL fil;
	// // FRESULT mres;
	// // UINT bww;
	// // char buff[50];
	// // mres = f_open(&fil,"0:/test/MyNewFile.txt",FA_CREATE_ALWAYS|FA_WRITE);	//创建并进入写模式
	// // printf("open/FA_CREATE_ALWAYS|FA_WRITE:%d\r\n",mres);
	// // mres = f_write(&fil,"ysc yyds",50,&bww);
	// // printf("write:%d\r\n",mres);
	// // f_close(&fil);
	// // mres = f_open(&fil,"0:/test/MyNewFile.txt",FA_READ);
	// // printf("open/FA_READ:%d\r\n",mres);
	// // mres = f_read(&fil,&buff,50,&bww);
	// // printf("read:%d\r\n",mres);
	// // f_close(&fil);
	// // printf("%c",buff);
	// // lcd_show_string(30, 200, 210, 16, 16, (char *)buff, RED);

    // while (1)
    // {
    //     t++;
    //     delay_ms(200);
    //     LED0_TOGGLE(); /* LED0闪烁 */
    // }

	/******************************************************
	SD卡实验
	*******************************************************/
	// uint8_t t = 0;

	// my_mem_init(SRAMIN);                /* 初始化内部SRAM内存池 */

	// lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30,  70, 200, 16, 16, "SD TEST", RED);
    // lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
    // lcd_show_string(30, 110, 200, 16, 16, "KEY0:Read Sector 0", RED);

    // while (sd_init()) /* 检测不到SD卡 */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "SD Card Error!", RED);
    //     delay_ms(500);
    //     lcd_show_string(30, 130, 200, 16, 16, "Please Check! ", RED);
    //     delay_ms(500);
    //     LED0_TOGGLE(); /* 红灯闪烁 */
    // }

    // /* 打印SD卡相关信息 */
    // show_sdcard_info();

    // /* 检测SD卡成功 */
    // lcd_show_string(30, 130, 200, 16, 16, "SD Card OK    ", BLUE);
    // lcd_show_string(30, 150, 200, 16, 16, "SD Card Size:     GB", BLUE);
    // lcd_show_num(30 + 13 * 8, 150, SD_TOTAL_SIZE_GB(&g_sdcard_handler), 5, 16, BLUE); /* 显示SD卡容量 */

    // while (1)
    // {

    //     if (key1_scan())   /* KEY0按下了 */
    //     {
    //         sd_test_read(0, 1); /* 从0扇区读取1*512字节的内容 */
    //     }

