great-man2096/STM32F103ZET6-TEST/User/main.c
    //     t++;
    //     delay_ms(10);

    //     if (t == 20)
    //     {
    //         LED0_TOGGLE(); /* 红灯闪烁 */
    //         t = 0;
    //     }
    // }

	/******************************************************
	内存管理实验
	*******************************************************/	
	// uint8_t paddr[20];  /* 存放P Addr:+p地址的ASCII值 */
    // uint16_t memused = 0;
    // uint8_t i = 0;
    // uint8_t *p = 0;
    // uint8_t *tp = 0;
    // uint8_t sramx = 0;  /* 默认为内部sram */
	// // sram_init();                        /* SRAM初始化 */
    // my_mem_init(SRAMIN);                /* 初始化内部SRAM内存池 */
    // // my_mem_init(SRAMEX);                /* 初始化外部SRAM内存池 */

    // lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30,  70, 200, 16, 16, "MALLOC TEST", RED);
    // lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
    // lcd_show_string(30, 110, 200, 16, 16, "KEY0:Malloc & WR & Show", RED);
    // lcd_show_string(30, 130, 200, 16, 16, "KEY_UP:SRAMx KEY1:Free", RED);
    // lcd_show_string(60, 160, 200, 16, 16, " SRAMIN ", BLUE);
    // lcd_show_string(30, 176, 200, 16, 16, "SRAMIN   USED:", BLUE);
    // lcd_show_string(30, 192, 200, 16, 16, "SRAMEX   USED:", BLUE);

	// while (1)
	// {
	// 	if (key2_scan()) /* KEY0按下 */
	// 	{
	// 		printf("E0按下\r\n");
	// 		p = mymalloc(sramx, 2048); /* 申请2K字节,并写入内容,显示在lcd屏幕上面 */
	// 		printf("P Addr:0X%08X\r\n", p);
	// 		if (p != NULL)
	// 		{
	// 			printf("p != null\r\n");
	// 			sprintf((char *)p, "Memory Malloc Test%03d", i);		/* 向p写入一些内容 */
	// 			lcd_show_string(30, 260, 209, 16, 16, (char *)p, BLUE); /* 显示P的内容 */
	// 			printf("显示P的内容结束\r\n");
	// 		}
	// 	}

	// 	if (key1_scan()) /* KEY1按下 */
	// 	{
	// 		printf("C13按下\r\n");
	// 		myfree(sramx, p); /* 释放内存 */
	// 		p = 0;			  /* 指向空地址 */
	// 	}

	// 	if (key4_scan()) /* KEY UP按下 */
	// 	{
	// 		printf("A0按下\r\n");
	// 		sramx++;

	// 		if (sramx > 1)
	// 			sramx = 0;

	// 		lcd_show_string(60, 160, 200, 16, 16, (char *)SRAM_NAME_BUF[sramx], BLUE);
	// 	}

	// 	if (tp != p)
	// 	{
	// 		tp = p;
	// 		sprintf((char *)paddr, "P Addr:0X%08X", (uint32_t)tp);
	// 		lcd_show_string(30, 240, 209, 16, 16, (char *)paddr, BLUE); /* 显示p的地址 */

	// 		if (p)
	// 		{
	// 			lcd_show_string(30, 260, 280, 16, 16, (char *)p, BLUE); /* 显示P的内容 */
	// 		}
	// 		else
	// 		{
	// 			lcd_fill(30, 260, 209, 296, WHITE); /* p=0,清除显示 */
	// 		}
	// 	}

	// 	delay_ms(10);
	// 	i++;

	// 	if ((i % 20) == 0)
	// 	{
	// 		memused = my_mem_perused(SRAMIN);
	// 		sprintf((char *)paddr, "%d.%01d%%", memused / 10, memused % 10);
	// 		lcd_show_string(30 + 112, 176, 200, 16, 16, (char *)paddr, BLUE); /* 显示内部内存使用率 */

	// 		// memused = my_mem_perused(SRAMEX);
	// 		// sprintf((char *)paddr, "%d.%01d%%", memused / 10, memused % 10);
	// 		// lcd_show_string(30 + 112, 192, 200, 16, 16, (char *)paddr, BLUE); /* 显示TCM内存使用率 */

	// 		LED0_TOGGLE(); /* LED0闪烁 */
	// 	}
	// }

	/******************************************************
	stmflash实验
	*******************************************************/
    // uint16_t i = 0;
	// uint8_t datatemp[SIZE];

	// lcd_show_string(30,  50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30,  70, 200, 16, 16, "FLASH EEPROM TEST", RED);
    // lcd_show_string(30,  90, 200, 16, 16, "ATOM@ALIENTEK", RED);
    // lcd_show_string(30, 110, 200, 16, 16, "KEY1:Write  KEY0:Read", RED);

    // while (1)
    // {

    //     if (key2_scan()) /* KEY1按下,写入STM32 FLASH */
    //     {
    //         lcd_fill(0, 150, 239, 319, WHITE); /* 清除半屏 */
    //         lcd_show_string(30, 150, 200, 16, 16, "Start Write FLASH....", RED);
    //         stmflash_write(FLASH_SAVE_ADDR, (uint16_t *)g_text_buf, SIZE);
    //         lcd_show_string(30, 150, 200, 16, 16, "FLASH Write Finished!", RED); /* 提示传送完成 */
    //     }

    //     if (key1_scan()) /* KEY0按下,读取字符串并显示 */
    //     {
    //         lcd_show_string(30, 150, 200, 16, 16, "Start Read FLASH.... ", RED);
    //         stmflash_read(FLASH_SAVE_ADDR, (uint16_t *)datatemp, SIZE);
    //         lcd_show_string(30, 150, 200, 16, 16, "The Data Readed Is:  ", RED); /* 提示传送完成 */
    //         lcd_show_string(30, 170, 200, 16, 16, (char *)datatemp, BLUE);       /* 显示读到的字符串 */
    //     }

    //     i++;
    //     delay_ms(10);

    //     if (i == 20)
    //     {
    //         LED0_TOGGLE(); /* 提示系统正在运行 */
    //         i = 0;
    //     }
    // }

	/******************************************************
	2.4G无线通讯实验
	*******************************************************/
	// uint8_t key, mode;
    // uint16_t t = 0;
    // uint8_t tmp_buf[33];
	// nrf24l01_init();                    /* 初始化NRF24L01 */

    // lcd_show_string(30, 50, 200, 16, 16, "STM32", RED);
    // lcd_show_string(30, 70, 200, 16, 16, "NRF24L01 TEST", RED);
    // lcd_show_string(30, 90, 200, 16, 16, "ATOM@ALIENTEK", RED);

    // while (nrf24l01_check()) /* 检查NRF24L01是否在线 */
    // {
    //     lcd_show_string(30, 110, 200, 16, 16, "NRF24L01 Error", RED);
    //     delay_ms(200);
    //     lcd_fill(30, 110, 239, 130 + 16, WHITE);
    //     delay_ms(200);
    // }

    // lcd_show_string(30, 110, 200, 16, 16, "NRF24L01 OK", RED);

    // while (1) /* 提醒用户选择模式 */
    // {

    //     if (key2_scan())
    //     {
    //         mode = 0; /* 接收模式 */
    //         break;
    //     }
    //     else if (key1_scan())
    //     {
    //         mode = 1; /* 发送模式 */
    //         break;
    //     }

    //     t++;

    //     if (t == 100) /* 显示提示信息 */
    //     {
    //         lcd_show_string(10, 130, 230, 16, 16, "key_E0:RX_Mode  key_C13:TX_Mode", RED);
    //     }

    //     if (t == 200) /* 关闭提示信息 */
    //     {
    //         lcd_fill(10, 130, 230, 150 + 16, WHITE);
    //         t = 0;
    //     }

    //     delay_ms(5);
    // }

    // lcd_fill(10, 130, 240, 166, WHITE); /* 清空上面的显示 */

    // if (mode == 0) /* RX模式 */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "NRF24L01 RX_Mode", BLUE);
    //     lcd_show_string(30, 150, 200, 16, 16, "Received DATA:", BLUE);
    //     nrf24l01_rx_mode(); /* 进入RX模式 */

    //     while (1)
    //     {
    //         if (nrf24l01_rx_packet(tmp_buf) == 0) /* 一旦接收到信息,则显示出来. */
    //         {
    //             tmp_buf[32] = 0; /* 加入字符串结束符 */
    //             lcd_show_string(0, 170, lcddev.width - 1, 32, 16, (char *)tmp_buf, BLUE);
    //         }
    //         else
    //             delay_us(100);

