great-man2096/STM32F103ZET6-TEST/User/main.c
    //         t++;

    //         if (t == 10000) /* 大约1s钟改变一次状态 */
    //         {
    //             t = 0;
    //             LED0_TOGGLE();
    //         }
    //     }
    // }
    // else /* TX模式 */
    // {
    //     lcd_show_string(30, 130, 200, 16, 16, "NRF24L01 TX_Mode", BLUE);
    //     nrf24l01_tx_mode(); /* 进入TX模式 */
    //     mode = ' ';         /* 从空格键开始发送 */

    //     while (1)
    //     {
    //         if (nrf24l01_tx_packet(tmp_buf) == 0) /* 发送成功 */
    //         {
    //             lcd_show_string(30, 150, 239, 32, 16, "Sended DATA:", BLUE);
    //             lcd_show_string(0, 170, lcddev.width - 1, 32, 16, (char *)tmp_buf, BLUE);
    //             key = mode;

    //             for (t = 0; t < 32; t++)
    //             {
    //                 key++;

    //                 if (key > ('~'))
    //                     key = ' ';

    //                 tmp_buf[t] = key;
    //             }

    //             mode++;

    //             if (mode > '~')
    //                 mode = ' ';

    //             tmp_buf[32] = 0; /* 加入结束符 */
    //         }
    //         else
    //         {
    //             lcd_fill(0, 150, lcddev.width, 170 + 16 * 3, WHITE); /* 清空显示 */
    //             lcd_show_string(30, 150, lcddev.width - 1, 32, 16, "Send Failed ", BLUE);
    //         }

    //         LED0_TOGGLE();
    //         delay_ms(200);
    //     }
    // }


	/******************************************************
	电阻触摸屏实验
	*******************************************************/
	// tp_dev.init();                          /* 触摸屏初始化 */
	// lcd_show_string(30, 30, 200, 32, 32, "STM32", RED);
	// lcd_show_string(30, 70, 200, 16, 16, "ADC TEST", RED);
	// lcd_show_string(30, 90, 200, 16, 16, "YSC@burningCloud", RED);

    // if (tp_dev.touchtype != 0XFF)
    // {
    //     lcd_show_string(30, 110, 200, 16, 16, "Press KEY0 to Adjust", RED); /* 电阻屏才显示 */
    // }

    // delay_ms(1500);
    // load_draw_dialog();

    // if (tp_dev.touchtype & 0X80)
    // {
    //     ctp_test(); /* 电容屏测试 */
    // }
    // else
    // {
    //     rtp_test(); /* 电阻屏测试 */
    // }

	

	/******************************************************
	CAN实验
	*******************************************************/
	// can_init();
    // uint8_t i = 0, t = 0;
    // uint8_t cnt = 0;
    // uint8_t canbuf[8];
    // uint8_t rec_len = 0;
    // uint8_t rec_buf[8];

	// while(1) {
	// 	if (key2_scan()) /* KEY1按下,写入 */
	// 	{
	// 		for(i=0; i< 8;i++)
	// 		{
	// 			canbuf[i] = i+cnt;
	// 		}
	// 		can_send_msg(0x12345678,canbuf, 4);
	// 	}
	// 	rec_len = can_receive_msg(rec_buf);
	// 	if (rec_len)
	// 	{
	// 		for (uint8_t x = 0; x < rec_len; x++)
	// 		{
	// 			printf("%X ", rec_buf[x]);
	// 		}
	// 		printf("\r\n");
	// 	}

	// 	t++;
    //     delay_ms(10);

    //     if (t == 20)
    //     {
    //         LED0_TOGGLE(); /* 提示系统正在运行 */
    //         t = 0;
    //         cnt++;
    //     }
	// }

	/******************************************************
	SPI实验
	*******************************************************/
	// uint16_t i = 0;
	// uint8_t datatemp[TEXT_SIZE];
	// uint32_t flashsize;
	// uint16_t id = 0;
	// char idinfo[30];
	// norflash_init(); /* 初始化NORFLASH */

	// lcd_show_string(30, 50, 200, 16, 16, "STM32", RED);
	// lcd_show_string(30, 70, 200, 16, 16, "SPI TEST", RED);
	// lcd_show_string(30, 90, 200, 16, 16, "ATOM@ALIENTEK", RED);
	// lcd_show_string(30, 110, 200, 16, 16, "KEY1:Write  KEY0:Read", RED); /* 显示提示信息 */

	// id = norflash_read_id(); /* 读取FLASH ID */

	// while ((id == 0) || (id == 0XFFFF)) /* 检测不到FLASH芯片 */
	// {
	// 	lcd_show_string(30, 130, 200, 16, 16, "FLASH Check Failed!", RED);
	// 	delay_ms(500);
	// 	lcd_show_string(30, 130, 200, 16, 16, "Please Check!      ", RED);
	// 	delay_ms(500);
	// 	LED0_TOGGLE(); /* LED0闪烁 */
	// }

	// sprintf(idinfo,"SPI ID:%x FLASH Ready!", id);
	// lcd_show_string(30, 130, 200, 16, 16, idinfo, BLUE);
	// flashsize = 8 * 1024 * 1024; /* FLASH 大小为8M字节 */

	// while (1)
	// {
	// 	if (key2_scan()) /* KEY1按下,写入 */
	// 	{
	// 		lcd_fill(0, 150, 239, 319, WHITE); /* 清除半屏 */
	// 		lcd_show_string(30, 150, 200, 16, 16, "Start Write FLASH....", BLUE);
	// 		sprintf((char *)datatemp, "%s%d", (char *)g_text_buf, i);
	// 		norflash_write((uint8_t *)datatemp, flashsize - 100, TEXT_SIZE);	  /* 从倒数第100个地址处开始,写入SIZE长度的数据 */
	// 		lcd_show_string(30, 150, 200, 16, 16, "FLASH Write Finished!", BLUE); /* 提示传送完成 */
	// 	}

	// 	if (key1_scan()) /* KEY0按下,读取字符串并显示 */
	// 	{
	// 		lcd_show_string(30, 150, 200, 16, 16, "Start Read FLASH... . ", BLUE);
	// 		norflash_read(datatemp, flashsize - 100, TEXT_SIZE);				   /* 从倒数第100个地址处开始,读出SIZE个字节 */
	// 		lcd_show_string(30, 150, 200, 16, 16, "The Data Readed Is:   ", BLUE); /* 提示传送完成 */
	// 		lcd_show_string(30, 170, 200, 16, 16, (char *)datatemp, BLUE);		   /* 显示读到的字符串 */
	// 	}

	// 	i++;

	// 	if (i == 20)
	// 	{
	// 		LED0_TOGGLE(); /* LED0闪烁 */
	// 		i = 0;
	// 	}

	// 	delay_ms(10);
	// }

	/******************************************************
	IIC实验
	*******************************************************/
	// at24cxx_init();

	// /* 要写入到24c02的字符串数组 */
	// const uint8_t g_text_buf[] = {"STM32 IIC TEST"};
	// #define TEXT_SIZE       sizeof(g_text_buf)  /* TEXT字符串长度 */
	// uint16_t i = 0;
	// uint8_t datatemp[TEXT_SIZE];
	// lcd_show_string(30, 50, 200, 16, 16, "STM32", RED);
	// lcd_show_string(30, 70, 200, 16, 16, "IIC TEST", RED);
	// lcd_show_string(30, 90, 200, 16, 16, "ATOM@ALIENTEK", RED);
	// lcd_show_string(30, 110, 200, 16, 16, "KEY1:Write  KEY0:Read", RED);    /* 显示提示信息 */
	// while (at24cxx_check()) /* 检测不到24c02 */
	// {
	//     lcd_show_string(30, 130, 200, 16, 16, "24C02 Check Failed!", RED);
	//     lcd_show_string(30, 146, 200, 16, 16, "Please Check!      ", RED);
	//     delay_ms(500);
	//     LED1_TOGGLE();      /* 红灯闪烁 */
	// }

	// lcd_show_string(30, 130, 200, 16, 16, "24C02 Ready!", RED);

	// while (1)
	// {

	// 	if (key2_scan())
	// 	{
	// 		lcd_fill(0, 150, 239, 319, WHITE);  /* 清除半屏 */
	//         lcd_show_string(30, 150, 200, 16, 16, "Start Write 24C02....", BLUE);
	//         at24cxx_write(0, (uint8_t *)g_text_buf, TEXT_SIZE);
	//         lcd_show_string(30, 150, 200, 16, 16, "24C02 Write Finished!", BLUE);   /* 提示传送完成 */
	// 	}
	// 	else if (key1_scan())
	// 	{
	// 		lcd_show_string(30, 150, 200, 16, 16, "Start Read 24C02.... ", BLUE);
	//         at24cxx_read(0, datatemp, TEXT_SIZE);
	//         lcd_show_string(30, 150, 200, 16, 16, "The Data Readed Is:  ", BLUE);   /* 提示传送完成 */
	//         lcd_show_string(30, 170, 200, 16, 16, (char *)datatemp, BLUE);          /* 显示读到的字符串 */
	// 	}
	// 	i++;

	//     if (i == 20)
	//     {
	//         LED0_TOGGLE();  /* 红灯闪烁 */
	//         i = 0;
	//     }

	//     delay_ms(10);
	// }

	/******************************************************
	DAC实验,PWMDAC实验
	*******************************************************/
	// extern TIM_HandleTypeDef g_tim1_handler;
	// uint16_t adcx;
	// float temp;
	// uint8_t t = 0;
	// uint16_t pwmval = 0;
	// adc_init();
	// pwmdac_init(256 - 1, 0); /* PWM DAC 初始化, Fpwm = 72M/256 =281.25Khz */
	// lcd_show_string(30, 50, 200, 16, 16, "STM32", RED);
	// lcd_show_string(30, 70, 200, 16, 16, "PWM DAC TEST", RED);
	// lcd_show_string(30, 90, 200, 16, 16, "ATOM@ALIENTEK", RED);
	// lcd_show_string(30, 110, 200, 16, 16, "KEY_UP:+ KEY1:-", RED);
	// lcd_show_string(30, 130, 200, 16, 16, "PWM VAL:", BLUE);
	// lcd_show_string(30, 150, 200, 16, 16, "DAC VOL:0.000V", BLUE);
	// lcd_show_string(30, 170, 200, 16, 16, "ADC VOL:0.000V", BLUE);
	// while (1)
	// {
	// 	t++;
	// 	if (key1_scan()) /* PWM 占空比调高 */
	// 	{
	// 		if (pwmval < 3200) /* 范围限定 */
	// 		{
	// 			pwmval += 100;
	// 		}
	// 		/* 输出新的 PWM 占空比 */
	// 		pwmdac_set_voltage(pwmval);
	// 	}
	// 	else if (key2_scan()) /* PWM 占空比调低 */
	// 	{
	// 		if (pwmval > 100) /* 范围限定 */
	// 		{
	// 			pwmval -= 100;
	// 		}
	// 		else
	// 		{
	// 			pwmval = 0;
	// 		}
	// 		/* 输出新的 PWM 占空比 */
	// 		pwmdac_set_voltage(pwmval);
	// 	}
	// 	if (t == 10 || key1_scan() || key2_scan())
	// 	{	/* WKUP / KEY1 按下了, 或者定时时间到了 */
	// 		/* PWM DAC 定时器输出比较值 */
	// 		// adcx = __HAL_TIM_GET_COMPARE(&g_tim1_handler, PWMDAC_TIMX_CHY);
	// 		adcx = PWMDAC_TIMX_CCRX;
	// 		lcd_show_xnum(94, 130, adcx, 3, 16, 0, BLUE); /* 显示 CCRX 寄存器值 */
	// 		temp = (float)adcx * (3.3 / 256);			  /* 得到 DAC 电压值 */
	// 		adcx = temp;
	// 		lcd_show_xnum(94, 150, temp, 1, 16, 0, BLUE); /* 显示电压值整数部分 */
	// 		temp -= adcx;
	// 		temp *= 1000;
	// 		lcd_show_xnum(110, 150, temp, 3, 16, 0X80, BLUE); /* 电压值的小数部分 */
	// 		adcx = adc_get_result();	  /* ADC3 通道 1 的转换结果 */
	// 		temp = (float)adcx * (3.3 / 4096);				  /* 得到 ADC 电压值(adc 是 12bit 的) */
	// 		adcx = temp;
	// 		lcd_show_xnum(94, 170, temp, 1, 16, 0, BLUE); /* 显示电压值整数部分 */
	// 		temp -= adcx;
	// 		temp *= 1000;
	// 		lcd_show_xnum(110, 170, temp, 3, 16, 0X80, BLUE); /* 电压值的小数部分 */
	// 		LED0_TOGGLE();									  /* LED0 闪烁 */
	// 		t = 0;
	// 	}
	// 	delay_ms(10);
	// }

	/******************************************************
	DAC实验,正弦波实验
	*******************************************************/
	// adc_init();

	// lcd_show_string(30, 50, 200, 16, 16, "STM32", RED);
	// lcd_show_string(30, 70, 200, 16, 16, "DAC DMA Sine WAVE TEST", RED);
	// lcd_show_string(30, 90, 200, 16, 16, "ATOM@ALIENTEK", RED);
	// lcd_show_string(30, 110, 200, 16, 16, "KEY0:3Khz  KEY1:30Khz", RED);

	// lcd_show_string(30, 130, 200, 16, 16, "DAC VAL:", BLUE);
	// lcd_show_string(30, 150, 200, 16, 16, "DAC VOL:0.000V", BLUE);
	// lcd_show_string(30, 170, 200, 16, 16, "ADC VOL:0.000V", BLUE);

	// uint16_t adcx;
	// float temp;
	// uint8_t t = 0;
	// dac_dma_wave_init();
	// dac_creat_sin_buf(2048, 100);
	// dac_dma_wave_enable(100, 10 - 1, 72 - 1);
	// while (1)
	// {
	// 	t++;
	// 	if (key1_scan()) /* 高采样率 , 约1Khz波形 */
	// 	{
	// 		dac_creat_sin_buf(2048, 100);
	// 		dac_dma_wave_enable(100, 10 - 1, 24 - 1); /* 300Khz触发频率, 100个点, 得到最高3KHz的正弦波. */
	// 	}
	// 	else if (key2_scan()) /* 低采样率 , 约1Khz波形 */
	// 	{
	// 		dac_creat_sin_buf(2048, 10);
	// 		dac_dma_wave_enable(10, 10 - 1, 24 - 1); /* 300Khz触发频率, 10个点, 可以得到最高30KHz的正弦波. */
	// 	}

	// 	adcx = DAC1->DHR12R1;						  /* 获取DAC1_OUT1的输出状态 */
	// 	lcd_show_xnum(94, 130, adcx, 4, 16, 0, BLUE); /* 显示DAC寄存器值 */

	// 	temp = (float)adcx * (3.3 / 4096); /* 得到DAC电压值 */
	// 	adcx = temp;
	// 	lcd_show_xnum(94, 150, temp, 1, 16, 0, BLUE); /* 显示电压值整数部分 */

