great-man2096/STM32F103ZET6-TEST/User/main.c
	// 低功耗实验
	//	uint8_t t = 0;
	//	pwr_wkup_key_init();	//对唤醒键A0中断初始化
	//	pwr_pvd_init(PWR_PVDLEVEL_7);
	//	printf("Enter to LowPower Test \r\n");
	////
	//	while(1){
	//		if (key1_scan())	//如果C13按下
	//		{
	//			/* 进入睡眠模式 */
	//			printf("Enter SLEEP Mode \r\n");
	//			HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON,PWR_SLEEPENTRY_WFI);
	//			printf("Exit SLEEP Mode \r\n");
	//		}
	//		else if (key2_scan())	//如果E0按下
	//		{
	//			LED0(1);
	//			/* 进入停止模式 */
	//			printf("Enter STOP Mode \r\n");
	//			HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON,PWR_SLEEPENTRY_WFI);
	//			sys_stm32_clock_init(RCC_PLL_MUL9); /* 设置时钟, 72Mhz */
	//			HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK_DIV8);	//设置定时器
	//			HAL_SuspendTick();	//停止中断
	//			printf("Exit STOP Mode \r\n");
	//			LED0(0);
	//		}
	//		else if (key3_scan())	//如果A1按下
	//		{
	//			/* 进入待机模式 */
	//			printf("Enter STANDBY Mode \r\n");
	//			__HAL_RCC_PWR_CLK_ENABLE();	//因为要操作电源，使能电源时钟
	//			HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN1);	//使能WKUP上升沿的唤醒功能
	//			__HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);	//清除唤醒标记
	//
	//			HAL_PWR_EnterSTANDBYMode();
	//			printf("不会打印这条，因为推出待机会重启 Exit StandBy Mode \r\n");
	//		}
	//
	//			t++;
	//			delay_ms(10);
	//		if (t > 50) /* 控制 LED1 闪烁, 提示程序运行状态 */
	//		{
	//			t = 0;
	//			LED1_TOGGLE();
	//		}
	//
	//	}

	// RTC计时与闹钟实验
	//	rtc_init();		//RTC初始化
	////	uint8_t tbuf[40];
	//    uint8_t t = 0;
	//	/* 定义字符数组用于显示周 */
	// char* weekdays[]={"Sunday","Monday","Tuesday","Wednesday",
	//                  "Thursday","Friday","Saterday"};
	//	rtc_set_alarm(2023, 4, 19, 10, 1, 0);  /* 设置一次闹钟年月日时分秒 */
	//	printf("YSC的实验输出：\r\n");
	////	LCD_ShowString(30, 50, 200, 16, 16, "STM32", RED);
	////    LCD_ShowString(30, 70, 200, 16, 16, "RTC TEST", RED);
	////    LCD_ShowString(30, 90, 200, 16, 16, "ATOM@ALIENTEK", RED);

	//	while (1)
	//    {
	//        t++;

	//        if ((t % 100) == 0)                  /* 每100ms更新一次显示数据 */
	//        {
	//            rtc_get_time();
	//            printf("Time:%02d:%02d:%02d \r\n", calendar.hour, calendar.min, calendar.sec);
	//            printf("Date:%04d-%02d-%02d \r\n", calendar.year, calendar.month, calendar.date);
	//            printf("Week:%s \r\n", weekdays[calendar.week]);
	//        }

	//        if ((t % 20) == 0)
	//        {
	//            LED0_TOGGLE();              /* 每200ms,翻转一次LED0 */
	//        }

	//        delay_ms(10);
	//    }

	// usmart调试实验
	//	   while(1)
	//     {
	//         LED0(0);

	//		delay_ms(500);
	//		LED0(1);

	//		delay_ms(500);
	//    }

	// LCD亮屏实验
	//	uint8_t x = 0;
	//    uint8_t lcd_id[12];
	//	 g_point_color = RED;
	//    sprintf((char *)lcd_id, "LCD ID:%04X", lcddev.id);  /* 将LCD ID打印到lcd_id数组 */

	//    while (1)
	//    {
	//        switch (x)
	//        {
	//        case 0:
	//            lcd_clear(WHITE);
	//            break;

	//        case 1:
	//            lcd_clear(BLACK);
	//            break;

	//        case 2:
	//            lcd_clear(BLUE);
	//            break;

	//        case 3:
	//            lcd_clear(RED);
	//            break;

	//        case 4:
	//            lcd_clear(MAGENTA);
	//            break;

	//        case 5:
	//            lcd_clear(GREEN);
	//            break;

	//        case 6:
	//            lcd_clear(CYAN);
	//            break;

	//        case 7:
	//            lcd_clear(YELLOW);
	//            break;

	//        case 8:
	//            lcd_clear(BRRED);
	//            break;

	//        case 9:
	//            lcd_clear(GRAY);
	//            break;

	//        case 10:
	//            lcd_clear(LGRAY);
	//            break;

	//        case 11:
	//            lcd_clear(BROWN);
	//            break;
	//        }

	//        lcd_show_string(10, 40, 240, 32, 32, "STM32", RED);
	//        lcd_show_string(10, 80, 240, 24, 24, "TFTLCD TEST", RED);
	//        lcd_show_string(10, 110, 240, 16, 16, "ATOM@ALIENTEK", RED);
	//        lcd_show_string(10, 130, 240, 16, 16, (char *)lcd_id, RED); /* 显示LCD ID */
	//        x++;

	//        if (x == 12)
	//            x = 0;

	//        LED0_TOGGLE(); /*红灯闪烁*/
	//        delay_ms(1000);
	//    }

	// 高级定时器PWM输入实验
	//		GPIO_InitTypeDef gpio_init_struct;
	//	/* 将 LED0 引脚设置为输入模式, 避免和 PE5 冲突 */
	//	__HAL_RCC_GPIOD_CLK_ENABLE();
	//	gpio_init_struct.Pin = GPIO_PIN_13; /* LED0 引脚 */
	//	gpio_init_struct.Mode = GPIO_MODE_INPUT; /* 设置输入状态 */
	//	gpio_init_struct.Pull = GPIO_PULLDOWN; /* 下拉 */
	//	gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH; /* 高速 */
	//	HAL_GPIO_Init(GPIOD, &gpio_init_struct); /* 初始化 LED0 引脚 */
	//	gtim_timx_pwm_chy_init(10 - 1 , 72 - 1);
	//	TIM3->CCR2 = 5;
	//	atim_timx_pwmin_chy_init();

	//	uint8_t t = 0;
	//	double ht, ct, f, tpsc;

	//	while (1)
	//	{
	//		delay_ms(10);
	//		t++;
	//		if (t >= 20) /* 每 200ms 输出一次结果,并闪烁 LED0,提示程序运行 */
	//		{
	//			if (g_timxchy_pwmin_sta) /* 捕获了一次数据 */
	//			{
	//				printf("\r\n"); /* 输出空,另起一行 */
	//				printf("PWM PSC :%d\r\n", g_timxchy_pwmin_psc); /* 打印分频系数 */
	//				printf("PWM Hight:%d\r\n", g_timxchy_pwmin_hval);/*打印高电平脉宽*/
	//				printf("PWM Cycle:%d\r\n", g_timxchy_pwmin_cval);/* 打印周期 */
	//				/* 得到 PWM 采样时钟周期时间 */
	//				tpsc = ((double)g_timxchy_pwmin_psc + 1)/72;
	//				ht = g_timxchy_pwmin_hval * tpsc; /* 计算高电平时间 */
	//				ct = g_timxchy_pwmin_cval * tpsc; /* 计算周期长度 */
	//				f = (1 / ct) * 1000000; /* 计算频率 */
	//				printf("PWM Hight time:%.3fus\r\n", ht); /* 打印高电平脉宽长度 */
	//				printf("PWM Cycle time:%.3fus\r\n", ct); /* 打印周期时间长度 */
	//				printf("PWM Frequency :%.3fHz\r\n", f); /* 打印频率 */
	//				atim_timx_pwmin_chy_restart(); /* 重启 PWM 输入检测 */
	//			}
	//			LED1_TOGGLE(); /* LED0(RED)闪烁 */
	//			t = 0;
	//		}
	//	}

	// 高级定时器互补输出带死区控制实验
	//	GPIO_InitTypeDef gpio_init_struct;
	//	/* 将 LED0 引脚设置为输入模式, 避免和 PC6 冲突 */
	//	gpio_init_struct.Pin = LED0_GPIO_PIN; /* LED0 引脚 */
	//	gpio_init_struct.Mode = GPIO_MODE_INPUT; /* 设置输入状态 */
	//	gpio_init_struct.Pull = GPIO_PULLDOWN; /* 下拉 */
	//	gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH; /* 高速 */
	//	HAL_GPIO_Init(LED0_GPIO_PORT, &gpio_init_struct); /* 初始化 LED0 引脚 */
	//	/* 将 LED1 引脚设置为输入模式, 避免和 PC6 冲突 */
	//	gpio_init_struct.Pin = LED1_GPIO_PIN; /* LED0 引脚 */
	//	gpio_init_struct.Mode = GPIO_MODE_INPUT; /* 设置输入状态 */
	//	gpio_init_struct.Pull = GPIO_PULLDOWN; /* 下拉 */
	//	gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH; /* 高速 */
	//	HAL_GPIO_Init(LED1_GPIO_PORT, &gpio_init_struct); /* 初始化 LED0 引脚 */
	//
	//	atim_timx_cplm_pwm_init(10000 - 1, 7200 - 1); /* 1Mhz 的计数频率 1Khz 的周期. */
	//	atim_timx_cplm_pwm_set(3000 - 1, 1000); /* 占空比:7:3,死区时间 100 * tDTS */
	//	while (1){}

