great-man2096/STM32F103ZET6-TEST/User/main.c
	// pwm输出比较实验
	//	GPIO_InitTypeDef gpio_init_struct;
	//	atim_timx_comp_pwm_init(1000 - 1, 72 - 1); /* 1Mhz 的计数频率 1Khz 的周期. */
	//	/* 将 LED0 引脚设置为输入模式, 避免和 PC6 冲突 */
	//	gpio_init_struct.Pin = LED0_GPIO_PIN; /* LED0 引脚 */
	//	gpio_init_struct.Mode = GPIO_MODE_INPUT; /* 设置输入状态 */
	//	gpio_init_struct.Pull = GPIO_PULLDOWN; /* 下拉 */
	//	gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH; /* 高速 */
	//	HAL_GPIO_Init(LED0_GPIO_PORT, &gpio_init_struct); /* 初始化 LED0 引脚 */
	//	/* 将 LED1 引脚设置为输入模式, 避免和 PC6 冲突 */
	//	gpio_init_struct.Pin = LED1_GPIO_PIN; /* LED0 引脚 */
	//	gpio_init_struct.Mode = GPIO_MODE_INPUT; /* 设置输入状态 */
	//	gpio_init_struct.Pull = GPIO_PULLDOWN; /* 下拉 */
	//	gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH; /* 高速 */
	//	HAL_GPIO_Init(LED1_GPIO_PORT, &gpio_init_struct); /* 初始化 LED0 引脚 */
	//	ATIM_TIMX_COMP_CH1_CCRX = 250 - 1; /* 通道 1 相位 25% */
	//	ATIM_TIMX_COMP_CH2_CCRX = 500 - 1; /* 通道 2 相位 50% */
	//	ATIM_TIMX_COMP_CH3_CCRX = 750 - 1; /* 通道 3 相位 75% */
	//	ATIM_TIMX_COMP_CH4_CCRX = 1000 - 1; /* 通道 4 相位 100% */
	//	while (1)
	//	{
	//		printf("程序正常运行...\r\n");
	//		delay_ms(10);
	//	}

	// 高级计时器指定PWM数实验
	//	uint8_t t = 0;
	//	GPIO_InitTypeDef gpio_init_struct;

	//	/* 将 LED1 引脚设置为输入模式, 避免和 PC6 冲突 */
	//	gpio_init_struct.Pin = LED0_GPIO_PIN; /* LED0 引脚 */
	//	gpio_init_struct.Mode = GPIO_MODE_INPUT; /* 设置输入状态 */
	//	gpio_init_struct.Pull = GPIO_PULLDOWN; /* 下拉 */
	//	gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH; /* 高速 */
	//	HAL_GPIO_Init(LED0_GPIO_PORT, &gpio_init_struct); /* 初始化 LED0 引脚 */

	//	atim_timx_npwm_chy_init(5000 - 1, 7200 - 1);/*10Khz 的计数频率,2hz 的 PWM 频率*/
	//
	//	atim_timx_npwm_chy_set(5); /* 输出 5 个 PWM 波(控制 LED0)闪烁 5 次) */

	//	while (1)
	//	{
	//		if (key1_scan()) /* KEY0 按下 */
	//		{
	//			atim_timx_npwm_chy_set(5); /* 输出 5 个 PWM 波(控制 LED0 闪烁 5 次) */
	//		}
	//			t++;
	//			delay_ms(10);
	//		if (t > 50) /* 控制 LED1 闪烁, 提示程序运行状态 */
	//		{
	//			t = 0;
	//			LED1_TOGGLE();
	//		}
	//	}
	//

	// 通用定时器脉冲计数实验
	//	uint32_t curcnt = 0;
	// uint32_t oldcnt = 0;
	// uint8_t t = 0;
	// gtim_timx_cnt_chy_init(0); /* 定时器计数初始化, 不分频 */
	// gtim_timx_cnt_chy_restart(); /* 重启计数 */
	//	while (1)
	// {
	// if (key1_scan() == 1) /* KEY1 按键按下,重启计数 */
	// {
	// gtim_timx_cnt_chy_restart(); /* 重新启动计数 */
	// }
	// curcnt = gtim_timx_cnt_chy_get_count(); /* 获取计数值 */
	// if (oldcnt != curcnt)
	// {
	// oldcnt = curcnt;
	// printf("CNT:%d\r\n", oldcnt); /* 打印脉冲个数 */
	// }
	// t++;
	// if (t > 20) /* 200ms 进入一次 */
	// {
	// t = 0;
	// LED0_TOGGLE(); /* LED0 闪烁 ,提示程序运行 */
	// }
	// delay_ms(10);
	// }

	// 测试PA0接口按键好不好使

	//	LED0(1); //点亮led0
	//	while (1)
	//	{
	//		if (key4_scan()){
	//			LED0_TOGGLE();
	//		}else
	//		{
	//			delay_ms(10);//允许误差10ms,消除抖动
	//		}
	//	 }
	//
	// 通用定时器输入/捕获实验
	//	uint32_t temp = 0;
	//	uint8_t t = 0;
	//	gtim_timx_cap_chy_init(0XFFFF, 72-1);
	//
	//	while(1){
	//		if (g_timxchy_cap_sta & 0X80){
	//			temp = g_timxchy_cap_sta & 0X3F;
	//			temp *= 65536;
	//			temp += g_timxchy_cap_val;
	//			printf("PushTime:%d us\r\n",temp);
	//			g_timxchy_cap_sta = 0;
	//		}
	//
	//		t++;
	//		if (t > 20){
	//			t = 0;
	//			LED0_TOGGLE();
	////			printf("串口正常\r\n");
	//		}
	//		delay_ms(10);
	//	}
	//

	// 通用定时器输出实验
	//	extern TIM_HandleTypeDef g_timx_pwm_chy_handle; /* 定时器句柄 */
	//	gtim_timx_pwm_chy_init(400-1,72-1); //定时器初始化
	//
	//	uint16_t ledrpwmval = 0;
	//	uint8_t dir = 1;
	//
	//	while(1){
	//		delay_ms(7);
	//		if(dir)ledrpwmval++;
	//		else ledrpwmval--;
	//		if(ledrpwmval > 300)dir = 0;
	//		if(ledrpwmval == 10)dir = 1;
	//
	//		//修改比较值控制占空比
	//		__HAL_TIM_SET_COMPARE(&g_timx_pwm_chy_handle,TIM_CHANNEL_2,ledrpwmval);
	//
	//	}
	//

	// 基本计数器实验
	//	btim_timx_int_init(5000 - 1, 7200 - 1); /* 10Khz 的计数频率，计数 5K 次为 500ms */
	//	 while (1)
	//	 {
	//		 LED0_TOGGLE();
	//		 delay_ms(200);
	//	 }

	//	//窗口看门狗实验
	//	LED0(1);
	//	delay_ms(3000);
	//	wwdg_init(0x7F, 0x5F, WWDG_PRESCALER_8);
	//	while(1){
	//		LED0(0);
	//		if(HAL_GPIO_ReadPin(GPIOC,GPIO_PIN_13) == 1){
	////		delay_ms(10); //允许误差10ms,消除抖动
	//			wwdg_feed();
	//		}
	//	}

	//	独立看门狗实验
	//	delay_ms(200); /* 延时 200ms 再初始化看门狗,LED0 的变化"可见" */
	//
	//	iwdg_init(IWDG_PRESCALER_64,625); /* 预分频数 64,重载值为 625,溢出时间约为 1s */
	//	LED0(1); /* 点亮 LED0(红灯) */
	//	 //printf("led0");
	//	 while (1)
	//	 {
	//		 if (key1_scan() == 1) /* 如果 K1 按下,则喂狗 */
	//		 {
	//			iwdg_feed(); /* 喂狗 */
	//		 }else{
	//			delay_ms(10);
	//		 }

	//	 }

	//	uint8_t len;
	//	uint16_t times = 0;
	//	printf("请输入数据,以回车键结束\r\n");
	//	while (1)
	//	 {
	//	 if (g_usart_rx_sta & 0x8000) /* 接收到了数据? */
	//	 {
	//		 len = g_usart_rx_sta & 0x3fff; /* 得到此次接收到的数据长度 */
	//		 printf("\r\n 您发送的消息为:\r\n");
	//		/*发送接收到的数据	Sends an amount of data in blocking mode.*/
	//		 HAL_UART_Transmit(&g_uart1_handle,(uint8_t*)g_usart_rx_buf,len,1000);
	//		/*等待发送结束*/
	//		while(__HAL_UART_GET_FLAG(&g_uart1_handle,UART_FLAG_TC)!=SET){};
	//		 printf("\r\n\r\n"); /* 插入换行 */
	//		 g_usart_rx_sta = 0;
	//	 }
	//	 else
	//	 {
	//		 times++;
	//		 if (times % 5000 == 0)
	//		 {
	//			 printf("\r\n STM32 开发板 串口实验：\r\n");
	//			 printf("50秒打印一次\r\n\r\n\r\n");
	//		 }
	//		 if (times % 500 == 0) printf("请输入数据,以回车键结束\r\n");  //两秒打印一次
	//		 if (times % 30 == 0) LED0_TOGGLE(); /* 0.3秒闪烁一次 LED,提示系统正在运行. */
	//		 delay_ms(10);
	//	 }
	//	 }

	//	key_init();							//KEY初始化
	//	exti_init();						//EXTI初始化
	//	//外部中断实验
	//	/*
	//	通过外部中断的方式让开发板上的两个独立按键控制 LED 灯：KEY0 控制 LED0 翻转，KEY1 控制 LED1 翻转。
	//	*/
	//	LED0(1); //点亮led0
	//	while (1)
	//	{
	//		printf("OK\r\n");
	//		delay_ms(1000);
	//	 }

	// 跑马灯实验
		// while(1)
	    // {
	    //     LED0(0);
		// 	LED1(1);
		// 	delay_ms(500);
		// 	LED0(1);
		// 	LED1(0);
		// 	delay_ms(500);
	    // }
	//按键实验
		// while(1){
		// 	if(key1_long_scan()){
		// 		LED0_TOGGLE();
		// 	}
		// 	else if(key2_scan())
		// 		{
		// 			LED1_TOGGLE();
		// 		}
		// 	else
		// 	{
		// 		delay_ms(10);//允许误差10ms,消除抖动
		// 	}
		// }
}
